Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_primary_school/primary_education_life_event.html.txt.tmx
Source language: en
Languages: ga

source: Most children in Ireland start their first-level education in primary schools (also called national schools) at the age of 4 or 5 years of age
ga: Mar a tharlaíonn, téann beagnach gach gasúr 5 bhliana agus thart ar leath na ngasúr 4 bliana ar bhunscoileanna (dá ngairtear scoileann náisiúnta)

source: Legally, children can be enrolled at primary school from the age of 4 upwards and must have started their formal education by the age of 6 years
ga: De réir dlí, is féidir le leanaí os cionn 4 bhliana bheith ar rolla bunscoile agus caithfidh leanaí a bhfuil 6 bhliana d'aois slán acu bunoideachas foirmiúil a thosú

source: The primary school cycle is 8 years long
ga: Tá an timthriall bunscoile 8 bhliana ar a fhad

source: Schools generally have 2 years of infant classes, followed by class 1 to class 6
ga: De ghnáth, caitheann na páistí 2 bhliain i ranganna na naíonán agus tagann ranganna 1 go 6 ina ndiaidh sin

source: The primary education sector is made up of different types of primary school including denominational schools, multi-denominational schools, Irish-speaking schools (called Gaelscoileanna), special schools and non-State-aided private primary schools
ga: Tá cineálacha éagsúla bunscoileanna san earnáil bhunoideachais. Orthu sin tá scoileanna ilchreidmheacha, scoileanna Ghaeilge (dá ngairtear Gaelscoileanna) agus scoileanna speisialta. Chomh maith leo sin tá bunscoileanna príobháideacha ann nach bhfaigheann aon mhaoiniú ón Rialtas

source: Education in State primary schools is free of charge
ga: Tá an t-oideachas i mbunscoileanna Stáit saor in aisce

source: The current and capital costs of primary schools, including teachers' salaries, are funded mainly by the Government and supplemented by local contributions
ga: Íocann an Rialtas costaisí caipitil agus costaisí reatha na mbunscoileanna, agus tuarastal na múinteoirí san áireamh, le beagán cúnaimh ó shíntiúis áitiúla

source: Enrolling your child at primary school
ga: Do pháiste a chur ar rolla bunscoile

source: You can send your child to the primary school of your choice, provided there is a place available for them
ga: Is féidir leat do pháiste a chur chuig an bunscoil a roghnaíonn tú, má tá áit inti

source: Where there is a shortage of places the school must give priority on the basis of their admissions or enrolment policy
ga: Má tá fadhb chóiríochta, caithfidh an scoil tosaíocht a chur i bhfeidhm de réir an pholasaithe cláraithe atá acu

source: This is drawn up by the board of management and should be available to you on request
ga: Cuireann an bord bainistíochta an polasaí seo le chéile agus ba cheart go mbeadh sé ar fáil duit ach é a iarraidh

source: You can find out more about different types of primary schools and their admissions policies
ga: Tá tuilleadh eolais faoi chineálacha éagsúla bunscoileanna agus na polasaithe cláraithe ar fáil anseo

source: To enrol your child in primary school, you should first check the list of primary schools in your area
ga: Chun do pháiste a chur ar an rolla, ba cheart duit ar dtús liosta na scoileanna i do cheantar a sheiceáil

source: Then you should contact the school of your choice to see if there is a place available
ga: Ansin, ba cheart duit dul i dteagmháil le do rogha scoile chun a fháil amach an bhfuil áit ar fáil

source: The school of your choice may place your child on a waiting list or you may need to contact other schools to find a place
ga: D’fhéadfadh an scoil atá roghnaithe agat do pháiste a chur ar liosta feithimh nó b’fhéidir go mbeidh ort dul i dteagmháil le scoileanna eile chun áit a fháil

source: Children with special educational needs are generally educated in mainstream schools
ga: De gnáth, is féidir le leanaí a bhfuil riachtanais speisialta oideachais acu a bheith i ngnáthranganna i mbunscoileanna

source: The length of the school day in primary school is 5 hours and 40 minutes
ga: Is é 5 uaire agus 40 nóiméad fad an lae scoile i mbunscoileanna na hÉireann

source: This includes assembly time, roll-call and breaks which are usually around 11am and 12.30pm
ga: Áirítear leis seo am chomhthionóil, glaoch an rolla agus na sosanna a bhíonn ann thart faoi 11.00 r.n

source: Primary schools may reduce the school day by an hour for children in their first 2 years at primary school (commonly called junior infants and senior infants) and in their third year at primary school (commonly called first class)
ga: agus 12.30 i.n. Féadfaidh bunscoileanna laghdú uair an chloig a dhéanamh ar an lá scoile le haghaidh leanaí ina gcéad dhá bhliain sa scoil (ar a dtugtar na leanaí sóisearacha agus na leanaí sinsearacha de ghnáth) agus le linn a dtríú bliana ar scoil (ar a dtugtar an chéad rang de ghnáth)

source: You can read the Department of Education and Skills (DES) Circular 11/95 Time in School (Primary) (pdf)
ga: Féadfaidh tú Ciorclán na Roinne Oideachais agus Scileanna 11/95 Am ar Scoil (Bunscoil) (pdf) a léamh anseo

source: Overall, primary schools must be open for a minimum of 183 days in each school year
ga: Caithfidh bunscoileanna a bheith ar oscailt ar feadh 183 lá san iomlán gach scoilbhliain

source: All schools must close for the months of July and August
ga: Caithfidh na scoileanna go léir dúnadh i rith mí Iúil agus mí Lúnasa

source: Christmas, Easter and mid-term breaks are standardised in both primary and post-primary schools
ga: Bíonn saoire caighdeánaithe na Nollag, na Cásca agus meántéarma sna bunscoileanna agus sna scoileanna iarbhunoideachais araon

source: While students do not have to wear a uniform at primary school, many schools (in consultation with parents) have introduced school uniforms
ga: Cé nach gá go gcaithfeadh daltaí éide scoile sna bunscoileanna, tá sé beartaithe ag a lán scoileanna, (i gcomhar leis na tuismitheoirí) a leithéid d’éide a bheith acu

source: Check with your school about their policy
ga: Cuir ceist ar do scoil faoin mbeartas atá acu faoi

source: There is an agreed set of recommendations on school uniform policy. There is also a DES Circular on the weight of schoolbags
ga: Is féidir Ciorclán na Roinne Oideachais agus Scileanna faoi mheáchan málaí scoile a léamh

source: The principal is responsible for running the school
ga: Is é nó í an príomhoide atá freagrach as an scoil a reáchtáil

source: Each class has a class teacher who teaches all subjects to their class
ga: Tá múinteoir ranga ag gach rang a mhúineann gach ábhar dóibh

source: In some smaller schools the teacher has more than one class
ga: Bíonn breis agus rang amháin ag múinteoirí i gcuid de na scoileanna beaga

source: There may be other teachers in the school such as a language support teacher to help learn English or a learning support teacher to help children who are having difficulty with the curriculum
ga: D’fhéadfadh múinteoirí eile a bheith sa scoil, mar múinteoirí tacaíochta teanga le cabhrú le daltaí Béarla a fhoghlaim nó múinteoir tacaíochta foghlama le cabhrú le leanaí a bhfuil deacrachtaí acu leis an gcuraclam

source: Schools set their own policy in relation to homework
ga: Ceapann scoileanna a mbeartais féin i leith obair bhaile

source: Children starting school for the first time will be in junior infants class
ga: Is i rang na leanaí sóisearacha a bhíonn na leanaí a thosaíonn ar scoil don chéad uair

source: If your child has attended school before, the principal, you and the class teacher will decide together which class your child will be in
ga: Déanfaidh an príomhoide agus tú féin agus an múinteoir ranga cinneadh faoin rang ina mbeidh do leanbh má bhí sé nó sí ag freastal ar scoil cheana

source: Children are only allowed to repeat a year for educational reasons and in special situations
ga: Is ar chúiseanna oideachasúla agus i gcásanna speisialta amháin a cheadaítear do leanaí cúrsa bliana a athdhéanamh

source: You can get more information in the DES Primary Circular 32/03 Retention of Pupils in Same Grade in Primary Schools (pdf)
ga: Féadfaidh tú tuilleadh eolais a fháil i gCiorclán na Roinne Oideachais agus Scileanna 32/03 Daltaí a Choinneáil sa Ghrád Céanna i mBunscoileanna (pdf)

source: Under the Education Act 1998 the school must provide reports for each child and the school must allow parents to have access to their child's school record
ga: De réir an Achta Oideachais 1998 ní mór don scoil tuarascálacha a chur ar fáil faoi gach leanbh agus caithfidh an scoil ligean do thuismitheoirí rochtain a fháil ar thaifead scoile a gcuid leanaí

source: Schools usually hold a parent/teacher meeting during the year
ga: De ghnáth, eagraíonn scoileanna cruinnithe idir mhúinteoirí agus tuismitheoirí i rith na bliana

source: If you are concerned about your child's progress at any stage during the year, you can speak to the class teacher
ga: Féadfaidh tú socrú a dhéanamh aon uair i rith na bliana labhairt leis an múinteoir ranga má tá imní ort faoi dhul chun cinn do linbh

source: If this doesn't resolve the problem you can speak to the school principal
ga: Má tá fadhb ag do leanbh ba chóir duit labhairt leis nó léi ar dtús

source: If you have a complaint about a teacher or about the school, the first step is usually to speak to the class teacher
ga: Má theipeann ort an fhadhb a réiteach sa bhaile ba chóir duit coinne a dhéanamh le labhairt leis an múinteoir ranga

source: If you have exhausted the school's complaints procedure and are still not satisfied, you can appeal to the Ombudsman for Children
ga: Mura réitíonn sé seo an fhadhb b’fhéidir go mbeidh ort coinne a dhéanamh chun labhairt leis an bpríomhoide

source: If your complaint is about a teacher’s fitness to teach, you should first use the school’s complaints procedure
ga: Má tá gearán agat faoin múinteoir nó faoin scoil ba chóir duit iarracht é a réiteach ar leibhéal na scoile

source: If you have exhausted this procedure and are not satisfied with the outcome, you can make a complaint to the Teaching Council
ga: Ní féidir leat a iarraidh ar an Roinn Oideachais agus Scileanna d’ábhar gearáin a scrúdú go dtí go mbíonn sé sin déanta agat

source: The Department of Education and Skills has no legal powers to investigate individual complaints about schools or to instruct schools to follow a particular course of direction with regard to individual complaints
ga: Tá cuntas i ndoiciméad na Roinne Nósanna Imeachta Gearán (Bunscoil) faoi na céimeanna ba chóir duit a ghlacadh nuair atá gearán á dhéanamh agat in aghaidh scoileanna agus múinteoirí

source: Absence and leaving school
ga: Neamhláithreachas agus fágáil scoile

source: If your child cannot attend school you must tell the school the reason for the absence
ga: Murar féidir le do leanbh freastal ar an scoil ní mór duit an fáth atá leis a insint don scoil

source: Write a short note to the school to explain why your child was out and send it in with your child when they go back to school
ga: Scríobh nóta chun na scoile agus mínigh cén fáth a raibh do leanbh as láthair agus cuir chuig an scoil é le do leanbh nuair a fhilleann sé nó sí

source: If you are changing school you should tell the school that your child is leaving and will not be returning
ga: Má tá tú ag aistriú do linbh go scoil eile ba chóir duit an scoil a chur ar an eolas go bhfuil do leanbh ag fágáil agus nach mbeidh sé nó sí ag filleadh

source: You can ask the principal to give you a report on your child's progress which can be given to the new school when you are enrolling your child
ga: Ba chóir duit a iarraidh ar an bpríomhoide tuarascáil a thabhairt duit faoi dhul chun cinn do linbh agus is féidir é seo a thabhairt don scoil nua nuair atá do leanbh á c(h)ur ar an rolla

source: You can find documents on our website about preschool education, teaching your child at home, the curriculum in primary schools, the ownership of primary schools, school discipline, bullying, school attendance, help with costs of books and uniform and school health screenings
ga: Anseo tá eolas le fáil faoi oideachas réamhscoile, oideachas baile, úinéireacht bunscoileanna, smacht, bulaíocht, tinreamh scoile, cabhair leis an gcostas leabhar agus éidí agus seirbhísí sláinte scoile

source: You can also find out more about programmes that address educational disadvantage such as tackling disadvantage in primary schools, the Early Start Programme and special educational arrangements for Travellers
ga: Tá eolas le fáil anseo faoi chláir a thugann faoi mhíbhuntáiste san oideachas ar nós ag dul i ngleic le míbhuntáiste, Luath-Thosú, socruithe speisialta oideachais don Lucht Siúil

source: There is a range of websites and organisations which you may find helpful if your child is starting primary education for the first time
ga: Má tá do leanbh ag tosú ar bhunoideachas tá réimse suíomh agus eagraíochtaí úsáideacha ann
